---
kind: other
id: Methods.T:Autodesk.Revit.DB.ModelCurveArrayIterator
source: html/deaf0522-80d3-28e8-854b-533f33f3ec3d.htm
---
# ModelCurveArrayIterator Methods

Causes the object to release immediately any resources it may be utilizing.